
const allTables = {
  "一、患者基本信息": {
    "患者基本信息": [1, 17],
  },
  "二、妇科相关信息": {
    "婚育史": [18, 30],
    "月经史": [31, 37],
  },
  "三、个人史、既往史、家族史": {
    "个人史": [38, 39],
    "既往史": [40, 44],
    "家族史": [45, 48],
  },
  "四、患者临床特征": {
    "首发症状": [49, 56],
    "临床分期": [57, 64],
    "活检病理": {
      "活检病理基本信息": [65, 66],
      "肿瘤病灶穿刺免疫组化": [67, 73],
      "淋巴结穿刺免疫组化": [74, 80],
      "远处转移免疫组化": [81, 88],
    },
    "新辅助治疗": [89, 92],
    "术前治疗": [93, 96],
  },
  "五、手术及病理信息": {
    "手术信息": [97, 101],
    "病理信息": [102, 125],
  },
  "六、术后辅助治疗": {
    "术后化疗": [126, 129],
    "术后内分泌治疗": [130, 133],
    "术后靶向治疗": [134, 136],
    "术后放疗": [137, 139],
    "术后免疫治疗": [140, 141],
  },
  "七、复发和随访信息": {
    "记录者信息": [142, 145],
    "复发信息": {
      "首次复发信息": [146, 152],
      "二次复发信息": [146, 152],
    },
    "远处转移信息": {
      "首次远处转移信息": [154, 157],
      "二次远处转移信息": [154, 157],
    },
    "随访信息": [159, 168],
  },
  "八、其他数据信息": {
    "21基因信息": [169, 175],
    "70基因信息": [176, 182],
    "BRCA基因检测": [183, 189],
    "外周血标本采样": {
      "采集信息": [190, 195],
      "存放信息": [196, 199],
      "取用信息": [200, 204],
    },
    "复发转移灶标本采样": {
      "基本情况": [205, 211],
      "存放信息": [212, 215],
      "取用信息": [216, 220],
    },
  },
};

const allSheetNames = Object.keys(allTables);

export {
  allTables,
  allSheetNames
};