import SoftBox from "../../../components/SoftBox";
import DashboardLayout from "../../../examples/LayoutContainers/DashboardLayout";
import DashboardNavbar from "../../../examples/Navbars/DashboardNavbar";
import TableCard from "./components/TableCard";
import { getIdCell, getDefaultCell } from "./columns/getCell";

const getColumns = (names, messages) => {
  let columns = [];
  for (let i = 0; i < names.length; i++) {
    columns[i] = {
      id: i + 1,
      name: names[i],
      message: messages[i],
    };
  }
  return columns;
};
const allColumnNames = ["姓名", "性别", "初诊年龄", "住院号", "婚姻状况", "民族", "职业", "籍贯", "现住址", "入院日期", "发现日期", "联系电话", "身份证号", "出生日期", "体重", "身高", "BMI", "生育", "确诊时生育状态", "初产年龄", "末胎年龄", "怀孕次数", "足月产", "流产或早产史", "是否辅助生育", "辅助生育方式", "是否母乳喂养", "哺乳侧别", "哺乳时长", "初潮年龄", "月经周期", "经期", "是否绝经", "绝经方式", "末次月经", "绝经年龄", "是否吸烟", "是否饮酒", "乳腺良性疾病史", "感染性疾病", "是否有系统疾病", "是否有手术史", "是否有恶性肿瘤既往史", "是否有恶性肿瘤家族史", "乳腺癌家族史", "卵巢癌家族史", "其他恶性肿瘤家族史", "发现方式", "肿瘤位置", "有无临床首发症状", "患侧乳头", "患侧皮肤", "乳头溢液", "溢液导管", "溢液性质", "影像检查号", "术前影像肿瘤大小\t", "术前T分期", "术前影像腋下淋巴结\t", "术前N分期", "远处转移与否\t", "转移部位\t", "临床TNM分期\t", "确诊方式", "确诊病理号", "肿瘤病灶穿刺ER\t", "肿瘤病灶穿刺PR\t", "肿瘤病灶穿刺Her2\t", "肿瘤病灶穿刺Ki67\t", "肿瘤病灶穿刺P53\t", "肿瘤病灶FISH copy数", "肿瘤病灶FISH ratio", "淋巴结穿刺ER\t", "淋巴结穿刺PR\t", "淋巴结穿刺Her2\t", "淋巴结穿刺Ki67\t", "淋巴结穿刺P53\t", "淋巴结FISH copy数", "淋巴结FISH ratio", "远处转移确诊部位", "远处转移灶ER\t", "远处转移灶PR\t", "远处转移灶Her2\t", "远处转移灶Ki67\t", "远处转移灶P53\t", "远处转移灶FISH copy数", "远处转移灶FISH ratio", "开始时间", "新辅助治疗方案及周期\t", "新辅助治疗过程评估", "新辅助治疗疗效评价\t", "开始时间", "术前治疗方案及周期\t", "术前治疗过程评估", "术前治疗疗效评价\t", "手术日期\t", "手术方式\t", "是否保乳\t", "是否再造\t", "腋窝淋巴结清扫方式", "术后大病理号", "病灶数量", "肉眼肿物大小", "病理学分期\t", "病理类型\t", "病理具体描述", "组织学分级\t", "淋巴血管侵犯与否", "淋巴管癌栓", "间质内浸润淋巴细胞", "化疗反应\t", "保乳手术标本周断端是否可见癌组织\t", "保乳手术标本周断端", "保乳手术标本补切周断端", "淋巴结情况\t", "腋窝淋巴结总数\t", "阳性腋窝淋巴结数\t", "ER\t", "PR\t", "HER2\t", "Ki67\t", "P53\t", "HER2-FISH COPY数", "HER2-FISH RATIO", "术后化疗", "化疗开始时间", "术后化疗（方案名称:如AC-T\t", "术后化疗（具体化疗用药、剂量、周期）", "术后内分泌治疗", "内分泌治疗开始时间", "术后内分泌治疗（药物名称）", "内分泌治疗副作用", "术后靶向治疗", "靶向治疗开始时间", "靶向治疗具体药物\t", "术后放疗\t", "放疗开始时间", "放疗备注", "术后免疫治疗\t", "免疫治疗开始时间", "首次录入人", "首次录入时间", "末次随访人", "末次随访时间", "首次复发部位", "首次复发日期\t", "首次复发确诊手段\t", "首次复发病灶病理信息", "首次复发病灶免疫组化", "首次复发后治疗", "首次复发后治疗效果评价", "字段同前", "首次远处转移部位\t", "首次远处转移日期\t", "首次远处转移治疗\t", "首次远处转移治疗效果评价\t", "字段同前", "DFS\t", "死亡与否\t", "死亡时间\t", "死因", "OS\t", "末次随访时间（截止查病历时/电话随诊）\t", "治疗后生育情况\t", "双原发癌症\t", "双原发癌症首次发生时间", "随访备注\t", "是否行21基因检测", "检测时间", "研究编号", "检测人员", "标本位置", "备注", "具体详情", "是否行21基因检测", "检测时间", "研究编号", "检测人员", "标本位置", "备注", "具体详情", "是否行BRCA基因检测", "检测时间", "研究编号", "检测人员", "标本位置", "备注", "具体详情", "标本类型", "采血时间点", "采血日期", "采集人", "备注", "用途", "标本编码", "标本量", "标本盒编码", "标本存放位置", "是否取用", "取用日期", "取用人", "用途", "备注", "关联病灶", "采样日期", "用途标识", "其他用途（填写）", "采集人", "标本类型", "标本性质", "标本编码", "标本量", "标本盒编码", "标本存放位置", "是否取用", "取用日期", "取用人", "用途", "备注"];
const allColumnMessages = ["nan", "nan", "发病时年龄改为初诊年龄", "病案号改为住院号", "已婚，未婚，离异，丧偶", "nan", "nan", "省市做成选项？", "具体地址。省市做成选项，可后期进行筛选", "nan", "nan", "电话改为联系电话，至少两个", "纠错功能？位数，男女，出生日期", "从身份证号自动摘录", "kg", "cm", "由身高体重自动计算(BMI)=体重(kg)/身高 (m)^2", "是，否（否则跳过20-32字段）", "选择（无，哺乳期，妊娠期)", "nan", "nan", "G改成怀孕次数", "x胎", "x次", "是，否（否则跳过27）", "nan", "是，否（否则跳过29-30）", "左/右/双", "nan", "nan", "天", "天", "是（是则跳过36），否（否则跳过33，37）", "自然，人工，备注", "日期", "nan", "是，否", "是，否", "无，纤维腺瘤，增生性疾病，导管内乳头状瘤，炎症性疾病，其他（具体备注）", "无，肝炎，结核，梅毒，艾滋，新冠", "无，高血压，心脏病，糖尿病，青光眼，哮喘，甲状腺疾病，脑血管疾病，精神疾病", "是则具体备注", "是则具体备注", "否则跳过47-49字段", "有则选“哪位亲属”，自动跳出这个亲属属于患者的“x级亲属”", "有则选“哪位亲属”，自动跳出这个亲属属于患者的“x级亲属”", "有则选“哪位亲属”患“x癌”（脑肿瘤，鼻咽癌，甲状腺癌，肺癌，胃癌，肝癌，胆囊癌，胰腺癌，结直肠癌，子宫颈癌，白血病，淋巴癌，肾癌，膀胱癌，其他备注），自动跳出这个亲属属于患者的“x级亲属”", "自查，体检，其他", "右乳，左乳，双乳", "肿块，乳头溢液，其他首发症状（具体描述）", "正常，凹陷，半固定，固定，湿疹样，乳头皴裂，乳头缺如，其他（具体描述）", "正常，水肿，卫星结节，破溃，桔皮样变，炎样红肿，静脉曲张，其他（具体描述）", "自发，非自发", "左侧，右侧，单个，多个", "陈旧血性，新鲜血性，淡黄，乳汁样，水样，脓性，其他（具体描述）", "b超（具体检查号），钼靶（具体检查号），核磁（具体检查号）", "nan", "由58自动生成", "位置（腋下Ⅰ水平，腋下Ⅱ水平，腋窝Ⅲ水平，锁骨下，锁骨上，乳内淋巴结），大小", "由60自动生成", "nan", "具体部位选择：肝、肺、骨、脑、其他（具体描述）", "由59,61,62选项自动生成，参照右表", "肿瘤病灶：术前开放活检，术中开放活检，穿刺粗针吸，穿刺细针吸", "nan", "数值和强度", "数值和强度", "阴性，1+，2+且FISH阴性，2+且FISH阳性，2+未做FISH，3+，其他（具体备注）", "nan", "nan", "nan", "nan", "数值和强度", "数值和强度", "阴性，1+，2+且FISH阴性，2+且FISH阳性，2+未做FISH，3+，其他（具体备注）", "nan", "nan", "nan", "nan", "nan", "数值和强度", "数值和强度", "阴性，1+，2+且FISH阴性，2+且FISH阳性，2+未做FISH，3+，其他（具体备注）", "nan", "nan", "nan", "nan", "年月日", "nan", "治疗前，1周期后，2周期后，3周期后，4周期后，5周期后，6周期后，7周期后，8周期后", "肿瘤病灶疗效评价（CR、PR、SD、PD)，淋巴结疗效评价（CR、PR、SD、PD)", "年月日", "nan", "治疗前，1周期后，2周期后，3周期后，4周期后，5周期后，6周期后，7周期后，8周期后", "肿瘤病灶疗效评价（CR、PR、SD、PD)，淋巴结疗效评价（CR、PR、SD、PD)，远处转移病灶疗效评价（CR、PR、SD、PD)", "年月日", "具体明称", "保乳，全切", "是，否", "腋清，前哨淋巴结活检", "nan", "nan", "具体描述", "分期，具体描述", "导管内癌，小叶原位癌，乳头湿疹样乳腺癌，浸润性导管癌，浸润性小叶癌，浸润性特殊癌（乳头状癌，髓样癌，小管癌，腺样囊性癌，粘液腺癌，大汗腺样癌，鳞状细胞癌），其他（具体描述）", "nan", "I，II，III，I-II，II-III，其他（具体描述）", "nan", "有、无", "数值%", "nan", "是、否", "具体描述", "具体描述", "具体描述", "nan", "nan", "分别记录“数值”和“着色强度”", "分别记录“数值”和“着色强度”", "阴性，1+，2+且FISH阴性，2+且FISH阳性，2+未做FISH，3+，其他（具体备注）", "分别记录“数值”和“着色强度”", "nan", "nan", "nan", "是，否（否则跳过51、52、53）", "nan", "具体字库待补充", "nan", "是，否（否则跳过55、56、57）", "nan", "具体字库待补充", "nan", "是，否（否则跳过59、60）", "nan", "nan", "是，否（否则跳过62、63）", "nan", "nan", "是，否（否则跳过65）", "nan", "nan", "nan", "nan", "nan", "胸壁复发，保乳术后复发，同侧腋窝及锁上淋巴结复发，其他（具体描述）", "nan", "无，粗针吸穿刺，细针吸穿刺，开放活检", "nan", "nan", "nan", "nan", "nan", "对侧乳腺，非同侧胸壁、区域淋巴结，骨、肺、肝、脑、其他（具体描述）", "二次转移，三次转移对应治疗。", "nan", "nan", "nan", "nan", "否则跳过161-163字段", "nan", "肿瘤，非肿瘤，具体备注", "nan", "nan", "nan", "无，对侧乳腺，非同侧胸壁、区域淋巴结，其他原发癌（详情备注）", "nan", "nan", "nan", "年", "nan", "nan", "nan", "nan", "nan", "nan", "年", "nan", "nan", "nan", "nan", "nan", "nan", "年", "nan", "nan", "nan", "nan", "nan", "nan", "nan", "年", "nan", "nan", "常规收集", "nan", "nan", "nan", "nan", "nan", "年", "nan", "nan", "nan", "nan", "年", "nan", "nan", "nan", "nan", "nan", "nan", "nan", "nan", "nan", "nan", "年", "nan", "nan", "nan"];
const data = getColumns(allColumnNames, allColumnMessages);
const columns = [
  {
    Header: "序号",
    accessor: "id",
    Cell: getIdCell,
  },
  {
    Header: "字段",
    accessor: "name",
    Cell: getDefaultCell,
  },
  {
    Header: "备注",
    accessor: "message",
    Cell: getDefaultCell,
  },
];


function AllColumnsView() {
  return (
    <DashboardLayout>
      <DashboardNavbar />
      <SoftBox my={3}>
        {TableCard(columns, data, data.length)}
      </SoftBox>
    </DashboardLayout>
  );
}

export default AllColumnsView;